app/Helpers/CommonHelper.php

        function get_settings($type)
        {
            $cacheKey = "business_setting_{$type}";

            // Check if the value is already in the cache
            if (Cache::has($cacheKey)) {
                return Cache::get($cacheKey);
            }

            // If not in the cache, retrieve the value from the database
            $businessSetting = BusinessSetting::where('type', $type)->first();
---
select * from `business_settings` where `type` = 'instagram' limit 1