app/Http/Controllers/Frontend/IndexController.php

    public function contact_save(Request $request)
    {
        $rules = [
            'cv' => 'nullable|mimetypes:application/pdf,application/msword',
            'g-recaptcha-response' => 'required|captcha',
        ];

        $validator = \Validator::make($request->all(), $rules); // Pass $request->all() as the first argument

        if ($validator->fails()) {
            return response()->json([
                'status' => false,
                'notification' => $validator->errors(),
            ]);
        }

        if ($request->hasFile('cv')) {
            $cvPath = $request->file('cv')->store('assets/image/pdf', 'public');
        } else {
            $cvPath = null; // Set to null if 'cv' is not provided
        }

        // Create the contact record, including 'cv' if provided
        $contactData = $request->all();
        $contactData['cv'] = $cvPath;

        // Create the contact record
        Contact::create($contactData);
---
insert into `contact` (`section`, `url`, `name`, `email`, `phone`, `services`, `description`, `cv`, `updated_at`, `created_at`) values ('Footer Form', 'http://127.0.0.1:8000', 'pos application', 'khanfaisal.makent@gmail.com', '8907654321', 'Corporate Secretarial', 'dsfdfsdf', '', '2023-11-13 13:27:31', '2023-11-13 13:27:31')