app/Http/Controllers/backend/BusinessSettingController.php

    public function update(Request $request) {
        // Assuming the request data is in key-value pairs

        // Get all the data from the request
        $requestData = $request->all();

        foreach ($requestData as $key => $value) {
            if($key != '_token'){
                BusinessSetting::where('type', $key)->update(['value' => $value]);
---
update `business_settings` set `value` = 'info@ahlawatassociates.in', `business_settings`.`updated_at` = '2023-11-13 10:28:09' where `type` = 'email'