app/Http/Controllers/backend/DashboardController.php

select count(*) as aggregate from `practice_areas`
select count(*) as aggregate from `blogs`
select count(*) as aggregate from `teams`
select count(*) as aggregate from `contact`
---
    public function index(){
        $practiceAreaCount = PracticeArea::count();
        $postCount = Blog::count();
        $teamCount = Team::count();
        $contactCount = Contact::count();